/*                                                       Сортировка пузырьком
Выполняется некоторое количество проходов по массиву — начиная от начала
массива, перебираются пары соседних элементов массива. Если 1-й элемент пары
больше 2-го, элементы переставляются (выполняется обмен). Пары элементов массива
перебираются (проходы по массиву повторяются) либо (n - 1) раз либо до тех пор,
пока на очередном проходе не обнаружится, что более не требуется выполнять
перестановки (обмены) (массив отсортирован). При каждом проходе алгоритма по
внутреннему циклу очередной наибольший элемент массива ставится на своё место в
конце массива рядом с предыдущим «наибольшим элементом», а наименьший элемент
перемещается на одну позицию к началу массива (как бы «всплывает» до нужной
позиции, как пузырёк в воде — откуда и название алгоритма).
*/

// В худшем и среднем случае O( n^2 ). В лучшем случае O( n )

#include <vector>

void BubbleSort(std::vector<int>& vec);